<img src="pandas_logo.svg" alt="NumPy Logo" style="width:250px; height:100px;">
<h1>Pandas DataFrame</h1>

In [8]:
# Importing the libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

<h3>DataFrame:</h3>
<ul>
    <li>Series is like a column in a table,  DataFrame is like a whole table.</li>
    <li>DataFrame is a 2 dimensional data structure like 2 dimensional array or a table with rows and columns.</li>
</ul>

<h4>Different ways of creating DataFrame in pandas:</h4>

In [12]:
# Reading the csv file
df = pd.read_csv("data.csv")
print(df)
# df.to_string()

    Duration\tPulse\tMaxpulse\tCalories\tTotal
0                   60\t110\t130\t409.1\t649.1
1                   60\t117\t145\t479.0\t741.0
2                   60\t103\t135\t340.0\t578.0
3                   45\t109\t175\t282.4\t566.4
4                   45\t117\t148\t406.0\t671.0
..                                         ...
164                 60\t105\t140\t290.8\t535.8
165                 60\t110\t145\t300.0\t555.0
166                 60\t115\t145\t310.2\t570.2
167                 75\t120\t150\t320.4\t590.4
168                 75\t125\t150\t330.4\t605.4

[169 rows x 1 columns]

In [14]:
# Reading the csv file
csv_file = pd.read_csv("data.csv")
# Passing a csv file to DataFrame
df = pd.DataFrame(csv_file)
print(df)
# df.to_string()

    Duration\tPulse\tMaxpulse\tCalories\tTotal
0                   60\t110\t130\t409.1\t649.1
1                   60\t117\t145\t479.0\t741.0
2                   60\t103\t135\t340.0\t578.0
3                   45\t109\t175\t282.4\t566.4
4                   45\t117\t148\t406.0\t671.0
..                                         ...
164                 60\t105\t140\t290.8\t535.8
165                 60\t110\t145\t300.0\t555.0
166                 60\t115\t145\t310.2\t570.2
167                 75\t120\t150\t320.4\t590.4
168                 75\t125\t150\t330.4\t605.4

[169 rows x 1 columns]

In [16]:
my_list = [10, 20, 30, 40, 50]
# Passing a list to a DataFrame
df = pd.DataFrame(my_list)
df

    0
0  10
1  20
2  30
3  40
4  50

In [18]:
# Specifying the index and column labels
df = pd.DataFrame([[10, 20, 30], [40, 50, 60], [70, 80, 90]], index = ["x", "y", "z"], columns = ["a", "b", "c"])
df

    a   b   c
x  10  20  30
y  40  50  60
z  70  80  90

In [19]:
my_array = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
# Passing a 2D array
df = pd.DataFrame(my_array)
df

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [20]:
my_list = [{"a":10, "b":20}, {"c":30, "d":40, "e":50}, {"a":60, "d":70}] # Keys as column labels; Values as values in the DataFrame
# Passing a dictionary
df = pd.DataFrame(my_list)
df

      a     b     c     d     e
0  10.0  20.0   NaN   NaN   NaN
1   NaN   NaN  30.0  40.0  50.0
2  60.0   NaN   NaN  70.0   NaN

In [21]:
my_dict = {"Names":["aa", "bb", "cc"], "Maths":[10, 20, 30], "Social":[40, 50, 60]}
df = pd.DataFrame(my_dict)
df

  Names  Maths  Social
0    aa     10      40
1    bb     20      50
2    cc     30      60

In [22]:
my_dict = {"Names":["aa", "bb", "cc"], "Maths":[10, 20, 30], "Social":[40, 50, 60]}
# Specifying only columns using columns keyword argument
df = pd.DataFrame(my_dict, columns = ["Names", "Maths"])
df

  Names  Maths
0    aa     10
1    bb     20
2    cc     30

In [23]:
my_dict = {"abc":np.random.randint(2, 6, size = 10), "def":np.random.randint(3, 10, size = 10), "ghi":np.random.randint(2, 10, size = (10))}
df = pd.DataFrame(my_dict)
df

   abc  def  ghi
0    2    8    9
1    3    3    4
2    2    4    8
3    2    4    4
4    4    4    5
5    4    8    7
6    2    4    2
7    4    5    7
8    4    4    8
9    5    5    4

In [30]:
df1 = pd.DataFrame({"abc":np.random.randint(2, 6, size = 10),"def":np.random.randint(3, 10, size = 10),"ghi":np.random.randint(2, 10, size = (10))}, columns = ["abc"])
df1

   abc
0    5
1    5
2    3
3    2
4    2
5    4
6    5
7    4
8    3
9    4

In [32]:
df2 = pd.DataFrame(df, columns = ["abc"])
df2

   abc
0    2
1    3
2    2
3    2
4    4
5    4
6    2
7    4
8    4
9    5

In [34]:
my_series = pd.Series([10, 20, 30, 40, 50])
df = pd.DataFrame(my_series)
df

    0
0  10
1  20
2  30
3  40
4  50

<h4>Indexing and slicing DataFrame:</h4>

In [37]:
my_dataframe = pd.DataFrame(
    {
        "R.No.":[101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
        "Names":["Matsya", "Kurma", "Varaha", "Narasimha", "Vamana", "Parashuram", "Rama", "Krishna", "Venkata", "Kalki"],
        "Maths":np.random.randint(39, 100, size = 10),
        "Science":np.random.randint(39, 100, size = 10),
        "Social":np.random.randint(39, 100, size = 10)
    }
)
my_dataframe

   R.No.       Names  Maths  Science  Social
0    101      Matsya     73       53      78
1    102       Kurma     82       71      53
2    103      Varaha     59       47      49
3    104   Narasimha     81       72      44
4    105      Vamana     43       53      88
5    106  Parashuram     96       88      61
6    107        Rama     92       82      97
7    108     Krishna     57       88      80
8    109     Venkata     56       75      86
9    110       Kalki     45       55      76

<h4>1. DataFrame [row name] [column name]</h4>

<h5>Accessing only Rows:</h5>

In [41]:
my_dataframe[0:].head()

   R.No.      Names  Maths  Science  Social
0    101     Matsya     73       53      78
1    102      Kurma     82       71      53
2    103     Varaha     59       47      49
3    104  Narasimha     81       72      44
4    105     Vamana     43       53      88

In [43]:
my_dataframe[0: 7: 2]

   R.No.   Names  Maths  Science  Social
0    101  Matsya     73       53      78
2    103  Varaha     59       47      49
4    105  Vamana     43       53      88
6    107    Rama     92       82      97

<h5>Accessing only Columns:</h5>

In [46]:
my_dataframe["R.No."].head(6)

0    101
1    102
2    103
3    104
4    105
5    106
Name: R.No., dtype: int64

In [48]:
my_dataframe[["R.No."]].tail(4)

   R.No.
6    107
7    108
8    109
9    110

In [50]:
my_dataframe[["R.No.", "Names"]]

   R.No.       Names
0    101      Matsya
1    102       Kurma
2    103      Varaha
3    104   Narasimha
4    105      Vamana
5    106  Parashuram
6    107        Rama
7    108     Krishna
8    109     Venkata
9    110       Kalki

<h5>Accessing Rows, Columns:</h5>

In [53]:
my_dataframe[0: 4]["R.No."]

0    101
1    102
2    103
3    104
Name: R.No., dtype: int64

In [55]:
my_dataframe[["R.No."]][0: 4]

   R.No.
0    101
1    102
2    103
3    104

In [57]:
my_dataframe[["R.No.", "Names"]][0: 4]

   R.No.      Names
0    101     Matsya
1    102      Kurma
2    103     Varaha
3    104  Narasimha

In [59]:
df = my_dataframe[my_dataframe["Maths"] >= 80]
df

   R.No.       Names  Maths  Science  Social
1    102       Kurma     82       71      53
3    104   Narasimha     81       72      44
5    106  Parashuram     96       88      61
6    107        Rama     92       82      97

In [61]:
df[["R.No.", "Names", "Maths"]]

   R.No.       Names  Maths
1    102       Kurma     82
3    104   Narasimha     81
5    106  Parashuram     96
6    107        Rama     92

<h4>2. DataFrame.loc [row name] [column name]</h4>

<h5>Accessing only Rows:</h5>

In [65]:
my_dataframe.loc[0]

R.No.         101
Names      Matsya
Maths          73
Science        53
Social         78
Name: 0, dtype: object

In [67]:
my_dataframe.loc[[0]]

   R.No.   Names  Maths  Science  Social
0    101  Matsya     73       53      78

In [69]:
my_dataframe.loc[[1, 2]]

   R.No.   Names  Maths  Science  Social
1    102   Kurma     82       71      53
2    103  Varaha     59       47      49

In [71]:
my_dataframe.loc[[0, 1], :]

   R.No.   Names  Maths  Science  Social
0    101  Matsya     73       53      78
1    102   Kurma     82       71      53

In [73]:
my_dataframe.loc[0: 4]

   R.No.      Names  Maths  Science  Social
0    101     Matsya     73       53      78
1    102      Kurma     82       71      53
2    103     Varaha     59       47      49
3    104  Narasimha     81       72      44
4    105     Vamana     43       53      88

<h5>Accessing only Columns:</h5>

In [76]:
my_dataframe.loc[:, "R.No."].head(4)

0    101
1    102
2    103
3    104
Name: R.No., dtype: int64

In [78]:
my_dataframe.loc[:, ["R.No."]].head(4)

   R.No.
0    101
1    102
2    103
3    104

In [80]:
my_dataframe.loc[:, ["Names","R.No."]].head(4)

       Names  R.No.
0     Matsya    101
1      Kurma    102
2     Varaha    103
3  Narasimha    104

In [82]:
my_dataframe.loc[:, "R.No.": "Maths"].head(4)

   R.No.      Names  Maths
0    101     Matsya     73
1    102      Kurma     82
2    103     Varaha     59
3    104  Narasimha     81

<h5>Accessing Rows and Columns:</h5>

In [85]:
my_dataframe.loc[1, "R.No."]

102

In [87]:
my_dataframe.loc[1]["R.No."]

102

In [89]:
my_dataframe.loc[[1], ["R.No."]]

   R.No.
1    102

In [91]:
my_dataframe.loc[[1, 2], "R.No."]

1    102
2    103
Name: R.No., dtype: int64

In [93]:
my_dataframe.loc[[1, 2], ["R.No."]]

   R.No.
1    102
2    103

In [95]:
my_dataframe.loc[[1, 2], ["R.No.", "Names"]]

   R.No.   Names
1    102   Kurma
2    103  Varaha

In [97]:
my_dataframe.loc[1: 4, ["R.No.", "Names"]]

   R.No.      Names
1    102      Kurma
2    103     Varaha
3    104  Narasimha
4    105     Vamana

In [99]:
my_dataframe.loc[1: 4, "R.No.": "Names"]

   R.No.      Names
1    102      Kurma
2    103     Varaha
3    104  Narasimha
4    105     Vamana

In [101]:
my_dataframe[my_dataframe["R.No."] == 105]

   R.No.   Names  Maths  Science  Social
4    105  Vamana     43       53      88

In [103]:
my_dataframe[my_dataframe["Names"] == "Narasimha"]

   R.No.      Names  Maths  Science  Social
3    104  Narasimha     81       72      44

<h4>3. DataFrame.iloc [row index] [column index]</h4>

<h5>Accessing only Rows:</h5>

In [107]:
my_dataframe.iloc[1]

R.No.        102
Names      Kurma
Maths         82
Science       71
Social        53
Name: 1, dtype: object

In [109]:
my_dataframe.iloc[[1]]

   R.No.  Names  Maths  Science  Social
1    102  Kurma     82       71      53

In [111]:
my_dataframe.iloc[1, 2]

82

In [113]:
my_dataframe.iloc[[1, 2]]

   R.No.   Names  Maths  Science  Social
1    102   Kurma     82       71      53
2    103  Varaha     59       47      49

In [115]:
my_dataframe.iloc[[1, 2], :]

   R.No.   Names  Maths  Science  Social
1    102   Kurma     82       71      53
2    103  Varaha     59       47      49

In [117]:
my_dataframe.iloc[1: 4]

   R.No.      Names  Maths  Science  Social
1    102      Kurma     82       71      53
2    103     Varaha     59       47      49
3    104  Narasimha     81       72      44

<h5>Accessing only Columns:</h5>

In [120]:
my_dataframe.iloc[:, 0].head(3)

0    101
1    102
2    103
Name: R.No., dtype: int64

In [122]:
my_dataframe.iloc[:, [0]].head(3)

   R.No.
0    101
1    102
2    103

In [124]:
my_dataframe.iloc[:, [1, 3]].head(3)

    Names  Science
0  Matsya       53
1   Kurma       71
2  Varaha       47

In [126]:
my_dataframe.iloc[:, 0: 3].head(3)

   R.No.   Names  Maths
0    101  Matsya     73
1    102   Kurma     82
2    103  Varaha     59

<h5>Accessing Columns and Rows:</h5>

In [129]:
my_dataframe.iloc[1, 2]

82

In [131]:
my_dataframe.iloc[1][2]

C:\Users\chira\AppData\Local\Temp\ipykernel_11368\1897654459.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  my_dataframe.iloc[1][2]

82

In [133]:
my_dataframe.iloc[[1], [2]]

   Maths
1     82

In [135]:
my_dataframe.iloc[[1, 2], 2]

1    82
2    59
Name: Maths, dtype: int32

In [137]:
my_dataframe.iloc[[1, 2], [2]]

   Maths
1     82
2     59

In [139]:
my_dataframe.iloc[2, [1, 2]]

Names    Varaha
Maths        59
Name: 2, dtype: object

In [141]:
my_dataframe.iloc[[2], [1, 2]]

    Names  Maths
2  Varaha     59

In [143]:
my_dataframe.iloc[0: 4, 2]

0    73
1    82
2    59
3    81
Name: Maths, dtype: int32

In [145]:
my_dataframe.iloc[0: 4, [2]]

   Maths
0     73
1     82
2     59
3     81

In [147]:
my_dataframe.iloc[0: 4, [2, 3]]

   Maths  Science
0     73       53
1     82       71
2     59       47
3     81       72

In [149]:
my_dataframe.iloc[0, 0: 3]

R.No.       101
Names    Matsya
Maths        73
Name: 0, dtype: object

In [167]:
my_dataframe.iloc[[0], 0: 3]

   R.No.   Names  Maths
0    101  Matsya     73

In [169]:
my_dataframe.iloc[[0, 3], 0: 3]

   R.No.      Names  Maths
0    101     Matsya     73
3    104  Narasimha     81

In [171]:
my_dataframe.iloc[0: 3, 0: 3]

   R.No.   Names  Maths
0    101  Matsya     73
1    102   Kurma     82
2    103  Varaha     59

In [173]:
for i, j in my_dataframe.iterrows():
    print(i)
    print(j)
    print("\n")

0
R.No.         101
Names      Matsya
Maths          73
Science        53
Social         78
Name: 0, dtype: object


1
R.No.        102
Names      Kurma
Maths         82
Science       71
Social        53
Name: 1, dtype: object


2
R.No.         103
Names      Varaha
Maths          59
Science        47
Social         49
Name: 2, dtype: object


3
R.No.            104
Names      Narasimha
Maths             81
Science           72
Social            44
Name: 3, dtype: object


4
R.No.         105
Names      Vamana
Maths          43
Science        53
Social         88
Name: 4, dtype: object


5
R.No.             106
Names      Parashuram
Maths              96
Science            88
Social             61
Name: 5, dtype: object


6
R.No.       107
Names      Rama
Maths        92
Science      82
Social       97
Name: 6, dtype: object


7
R.No.          108
Names      Krishna
Maths           57
Science         88
Social          80
Name: 7, dtype: object


8
R.No.          109
Names      Venkata
Maths           56
Science         75
Social          86
Name: 8, dtype: object


9
R.No.        110
Names      Kalki
Maths         45
Science       55
Social        76
Name: 9, dtype: object

In [175]:
for i, j in my_dataframe.iterrows():
    print(i, j["Names"])

0 Matsya
1 Kurma
2 Varaha
3 Narasimha
4 Vamana
5 Parashuram
6 Rama
7 Krishna
8 Venkata
9 Kalki

In [177]:
for i, j in my_dataframe.iterrows():
    print(i, j[["R.No.", "Names", "Maths"]])

0 R.No.       101
Names    Matsya
Maths        73
Name: 0, dtype: object
1 R.No.      102
Names    Kurma
Maths       82
Name: 1, dtype: object
2 R.No.       103
Names    Varaha
Maths        59
Name: 2, dtype: object
3 R.No.          104
Names    Narasimha
Maths           81
Name: 3, dtype: object
4 R.No.       105
Names    Vamana
Maths        43
Name: 4, dtype: object
5 R.No.           106
Names    Parashuram
Maths            96
Name: 5, dtype: object
6 R.No.     107
Names    Rama
Maths      92
Name: 6, dtype: object
7 R.No.        108
Names    Krishna
Maths         57
Name: 7, dtype: object
8 R.No.        109
Names    Venkata
Maths         56
Name: 8, dtype: object
9 R.No.      110
Names    Kalki
Maths       45
Name: 9, dtype: object

In [179]:
for i in my_dataframe.iterrows():
    print(i)
    print("\n")

(0, R.No.         101
Names      Matsya
Maths          73
Science        53
Social         78
Name: 0, dtype: object)


(1, R.No.        102
Names      Kurma
Maths         82
Science       71
Social        53
Name: 1, dtype: object)


(2, R.No.         103
Names      Varaha
Maths          59
Science        47
Social         49
Name: 2, dtype: object)


(3, R.No.            104
Names      Narasimha
Maths             81
Science           72
Social            44
Name: 3, dtype: object)


(4, R.No.         105
Names      Vamana
Maths          43
Science        53
Social         88
Name: 4, dtype: object)


(5, R.No.             106
Names      Parashuram
Maths              96
Science            88
Social             61
Name: 5, dtype: object)


(6, R.No.       107
Names      Rama
Maths        92
Science      82
Social       97
Name: 6, dtype: object)


(7, R.No.          108
Names      Krishna
Maths           57
Science         88
Social          80
Name: 7, dtype: object)


(8, R.No.          109
Names      Venkata
Maths           56
Science         75
Social          86
Name: 8, dtype: object)


(9, R.No.        110
Names      Kalki
Maths         45
Science       55
Social        76
Name: 9, dtype: object)